Elkaisar.World.Map.posX = function (xCoord, yCoord) {
    return xCoord * 64 - yCoord * 64;
};

Elkaisar.World.Map.posY = function (xCoord, yCoord) {
    return xCoord * 32 + yCoord * 32;
};


Elkaisar.World.Map.xCoord = function (x, y) {
    return Math.round((2 * y + x) / 128);
};
Elkaisar.World.Map.yCoord = function (x, y) {
    return Math.round((2 * y - x) / 128);
};

Elkaisar.World.Map.widthInTile = function () {
    return Math.ceil(Elkaisar.MAX_SCREEN_WIDTH / 128);
};
Elkaisar.World.Map.heightInTile = function () {
    return Math.ceil(Elkaisar.MAX_SCREEN_HEIGHT / 64);
};

Elkaisar.World.Map.posY = function (xCoord, yCoord) {
    return xCoord * 32 + yCoord * 32;
};

Elkaisar.World.Map.realCoord = function (coord) {
    return (500 * 500 + Number(coord)) % 500;
};

Elkaisar.World.Map.posZ = function (xCoord, yCoord) {

    var z_offset_x = (xCoord) < 0 ? -500 : (xCoord) > 499 ? 500 : 1;
    var z_offset_y = (yCoord) < 0 ? -500 : (yCoord) > 499 ? 500 : 1;

    return  500 * 500 * 500 + Math.max(this.realCoord(xCoord) + this.realCoord(yCoord)) + z_offset_y + z_offset_x;

};

Elkaisar.World.Map.getEntity = function (xCoord, yCoord) {

    var Unit = WorldUnit.getWorldUnit(xCoord, yCoord);

    if (WorldUnit.isRiver(Unit.ut) || WorldUnit.isEmpty(Unit.ut) || (Unit.ut) === WUT_BUSY_UNIT) {
        return Crafty.e("2D, Canvas , Mouse , WorldUnit, worldEnt").attr({_w: 128, _h: 128});
    }

    return Crafty.e(`2D, Canvas, ${Elkaisar.World.UnitData[Unit.t].tileName[Unit.l] || Elkaisar.World.UnitData[Unit.t].tileName[0]}, Mouse , WorldUnit, worldEnt`);

};
Elkaisar.World.UnitData = {

    "0": {

        snapShoot: "river_3.png",
        desc: null,
        maxLvl: 0,
        prom_lvl: 0,
        fitness: 0,
        make_req: [],
        join_req: [],
        hitArea: [64, 64, 128, 96, 64, 128, 0, 96],
        tileName: {"0": "floor"},
        getTitle: (x_coord, y_coord) => {
            return "مكان خالى";
        },
        timeNextRest: () => {
            return null;
        }

    },
    "1": {
        snapShoot: "river_3.png",
        desc: null,
        maxLvl: 0,
        prom_lvl: 0,
        fitness: 0,
        make_req: [],
        join_req: [],
        hitArea: [64, 64, 128, 96, 64, 128, 0, 96],
        tileName: {"0": "river_1"},
        getTitle: (x_coord, y_coord) => {
            return "بحيرة";
        },
        timeNextRest: () => {
            return null;
        }

    },
    "17": {
        snapShoot: "river_3.png",
        desc: null,
        maxLvl: 0,
        prom_lvl: 0,
        fitness: 0,
        make_req: [],
        join_req: [],
        hitArea: [112, 95, 70, 118, 23, 92, 65, 70],
        tileName: {"0": "city_0"},
        getTitle: (x_coord, y_coord) => {
            return "مدينة مستوى 1";
        },
        timeNextRest: () => {
            return null;
        }

    },
    "18": {

        snapShoot: "river_3.png",
        desc: null,
        maxLvl: 0,
        prom_lvl: 0,
        fitness: 0,
        make_req: [],
        join_req: [],
        hitArea: [103, 78, 106, 100, 63, 118, 18, 98, 17, 83, 58, 56],
        tileName: {"0": "city_1"},
        getTitle: (x_coord, y_coord) => {
            return "مدينة مستوى 2";
        },
        timeNextRest: () => {
            return null;
        }

    },
    "19": {

        snapShoot: "river_3.png",
        desc: null,
        maxLvl: 0,
        prom_lvl: 0,
        fitness: 0,
        make_req: [],
        join_req: [],
        hitArea: [105, 72, 107, 100, 63, 125, 15, 97, 21, 72, 61, 50],
        tileName: {"0": "city_2"},
        getTitle: (x_coord, y_coord) => {
            return "مدينة مستوى 3";
        },
        timeNextRest: () => {
            return null;
        }

    },
    "20": {

        snapShoot: "river_3.png",
        desc: null,
        maxLvl: 0,
        prom_lvl: 0,
        fitness: 0,
        make_req: [],
        join_req: [],
        hitArea: [63, 37, 11, 60, 6, 94, 66, 126, 124, 100, 115, 66],
        tileName: {"0": "city_3"},
        getTitle: (x_coord, y_coord) => {
            return "مدينة مستوى 4";
        },
        timeNextRest: () => {
            return null;
        }

    },
    "21": {

        snapShoot: "mountain_1.png",
        desc: null,
        maxLvl: 0,
        prom_lvl: 0,
        fitness: 0,
        make_req: [],
        join_req: [],
        hitArea: [101, 94, 67, 115, 27, 96, 63, 72],
        tileName: {1: "m_1", 2: "m_2", 3: "m_3", 4: "m_4"},
        getTitle: (x_coord, y_coord) => {
            return "هضبة";
        },
        timeNextRest: () => {
            return null;
        }

    },
    "22": {

        snapShoot: "mountain_2.png",
        desc: null,
        maxLvl: 0,
        prom_lvl: 0,
        fitness: 0,
        make_req: [],
        join_req: [],
        hitArea: [123, 96, 67, 123, 12, 96, 49, 66, 74, 52],
        tileName: {5: "m_5", 6: "m_6", 7: "m_7"},
        getTitle: (x_coord, y_coord) => {
            return "جبل";
        },
        timeNextRest: () => {
            return null;
        }

    },
    "23": {

        snapShoot: "mountain_3.png",
        desc: null,
        maxLvl: 0,
        prom_lvl: 0,
        fitness: 0,
        make_req: [],
        join_req: [],
        hitArea: [119, 92, 70, 122, 11, 90, 61, 27, 88, 31],
        tileName: {8: "m_8", 9: "m_9", 10: "m_10"},
        getTitle: (x_coord, y_coord) => {
            return "جبال";
        },
        timeNextRest: () => {
            return null;
        }

    },
    "24": {

        snapShoot: "desert_1.png",
        desc: null,
        maxLvl: 0,
        prom_lvl: 0,
        fitness: 0,
        make_req: [],
        join_req: [],
        hitArea: [65, 67, 20, 91, 73, 118, 105, 92],
        tileName: {1: "d_1", 2: "d_2", 3: "d_3", 4: "d_4"},
        getTitle: (x_coord, y_coord) => {
            return "رمال";
        },
        timeNextRest: () => {
            return null;
        }

    },
    "25": {

        snapShoot: "desert_2.png",
        desc: null,
        maxLvl: 0,
        prom_lvl: 0,
        fitness: 0,
        make_req: [],
        join_req: [],
        hitArea: [112, 98, 60, 120, 15, 96, 60, 72, 86, 66],
        tileName: {5: "d_5", 6: "d_6", 7: "d_7"},
        getTitle: (x_coord, y_coord) => {
            return "صحراء";
        },
        timeNextRest: () => {
            return null;
        }

    },
    "26": {

        snapShoot: "desert_3.png",
        desc: null,
        maxLvl: 0,
        prom_lvl: 0,
        fitness: 0,
        make_req: [],
        join_req: [],
        hitArea: [119, 97, 62, 120, 19, 95, 41, 77, 47, 56, 86, 58],
        tileName: {8: "d_8", 9: "d_9", "10": "d_10"},
        getTitle: (x_coord, y_coord) => {
            return "صحراء";
        },
        timeNextRest: () => {
            return null;
        }

    },
    "27": {

        snapShoot: "wood_1.png",
        desc: null,
        maxLvl: 0,
        prom_lvl: 0,
        fitness: 0,
        make_req: [],
        join_req: [],
        hitArea: [63, 72, 90, 83, 92, 97, 67, 112, 39, 99, 47, 84],
        tileName: {1: "w_1", 2: "w_2", 3: "w_3", 4: "w_4"},
        getTitle: (x_coord, y_coord) => {
            return "احراش";
        },
        timeNextRest: () => {
            return null;
        }

    },
    "28": {

        snapShoot: "wood_2.png",
        desc: null,
        maxLvl: 0,
        prom_lvl: 0,
        fitness: 0,
        make_req: [],
        join_req: [],
        hitArea: [64, 64, 106, 86, 109, 101, 66, 122, 27, 97, 33, 80],
        tileName: {5: "w_5", 6: "w_6", 7: "w_7"},
        getTitle: (x_coord, y_coord) => {
            return "اخشاب";
        },
        timeNextRest: () => {
            return null;
        }

    },
    "29": {

        snapShoot: "wood_3.png",
        desc: null,
        maxLvl: 0,
        prom_lvl: 0,
        fitness: 0,
        make_req: [],
        join_req: [],
        hitArea: [62, 48, 116, 77, 120, 97, 65, 127, 15, 100, 16, 74],
        tileName: {8: "w_8", 9: "w_9", 10: "w_10"},
        getTitle: (x_coord, y_coord) => {
            return "غابات";
        },
        timeNextRest: () => {
            return null;
        }

    },
    "30": {
        snapShoot: "monwrat.png",
        ar_title: "مناورات",
        prom_title: "مواطن",
        prom_lvl: 0,
        fitness: 40,
        make_req: ["necklace_4"],
        join_req: [""],
        getTitle: function (x_coord, y_coord) {
            return "مناورات";
        },
        desc: `
            مرحبا بكم في فتح باب الدم. ثق بي ، هذه مجرد البداية.

            بعد سلسلة من الحروب الطويلة ، أصبحت قوة قوات المتمردين في الجمهورية الرومانية أضعف وأضعف.
             النجاح الكبير لا يرجع فقط إلى تصميم مجلس الشيوخ ، ولكن أيضًا يرتبط ارتباطًا وثيقًا باستراتيجية عسكرية جديدة وافق عليها جميع قضاة المقاطعات سابقًا.
             وفقًا للاستراتيجية ، يلعب مجلس الشيوخ في الواقع لعبة القط والفأر مع المتمردين ، بهدف القضاء عليهم جميعًا في وقت واحد في المستقبل.
             هنا تأتي الفرصة الآن. لقد جمع المتمردون أخيرًا في الشمال الشرقي شديد البرودة كما هو متوقع.
             ومع ذلك ، فقد شكلوا مجموعة قوية للغاية تسمى محور الاستقلال وأعلنت Fearless Skullbearer كزعيم.
              Fearless Skullbearer هو مقاتلة حديدية الوحد الذي يوحد الغشاشين ويلهم قوات المتمردين. 
            مع نظر العالم إلى الشمال الشرقي للجمهورية الرومانية ، ينادي مجلس الشيوخ بهجوم عام ضد محور الاستقلال.`,
        maxLvl: 50,
        hitArea: [64, 0, 128, 32, 128, 96, 64, 128, 0, 96, 0, 32],
        tileName: {0: "mnawrat"},
        timeNextRest: function () {
            return TimeRest.restEvery12();
        }

    },
    "31": {
        snapShoot: "camps.png",
        ar_title: "معسكرات",
        prom_title: "مواطن",
        prom_lvl: 0,
        fitness: 40,
        make_req: ["necklace_4"],
        join_req: [""],
        getTitle: function (x_coord, y_coord) {
            if (x_coord === 136 && y_coord === 160) {
                return `المعسكر الفرنسى المتمرد`;
            } else if (x_coord === 407 && y_coord === 66) {
                return `المعسكر الاسيوى المتمرد`;
            } else if (x_coord === 106 && y_coord === 19) {
                return `المعسكر البريطانى المتمرد`;
            } else if (x_coord === 392 && y_coord === 213) {
                return `المعسكر المقدونى المتمرد`;
            } else if (x_coord === 266 && y_coord === 245) {
                return `المعسكر الايطالى المتمرد`;
            } else if (x_coord === 78 && y_coord === 300) {
                return `المعسكر الاسبانى المتمرد`;
            } else if (x_coord === 427 && y_coord === 337) {
                return `المعسكر الفارسى المتمرد`;
            } else if (x_coord === 316 && y_coord === 450) {
                return `المعسكر المصرى المتمرد`;
            } else if (x_coord === 88 && y_coord === 444) {
                return `المعسكر القرطاجى المتمرد`;
            } else if (x_coord === 246 && y_coord === 111) {
                return `المعسكر الالمانى المتمرد`;
            }
        },
        desc: `
            مرحبا بكم في فتح باب الدم. ثق بي ، هذه مجرد البداية.

            بعد سلسلة من الحروب الطويلة ، أصبحت قوة قوات المتمردين في الجمهورية الرومانية أضعف وأضعف.
             النجاح الكبير لا يرجع فقط إلى تصميم مجلس الشيوخ ، ولكن أيضًا يرتبط ارتباطًا وثيقًا باستراتيجية عسكرية جديدة وافق عليها جميع قضاة المقاطعات سابقًا.
             وفقًا للاستراتيجية ، يلعب مجلس الشيوخ في الواقع لعبة القط والفأر مع المتمردين ، بهدف القضاء عليهم جميعًا في وقت واحد في المستقبل.
             هنا تأتي الفرصة الآن. لقد جمع المتمردون أخيرًا في الشمال الشرقي شديد البرودة كما هو متوقع.
             ومع ذلك ، فقد شكلوا مجموعة قوية للغاية تسمى محور الاستقلال وأعلنت Fearless Skullbearer كزعيم.
              Fearless Skullbearer هو مقاتلة حديدية الوحد الذي يوحد الغشاشين ويلهم قوات المتمردين. 
            مع نظر العالم إلى الشمال الشرقي للجمهورية الرومانية ، ينادي مجلس الشيوخ بهجوم عام ضد محور الاستقلال.`,

        maxLvl: 50,
        hitArea: [63, 37, 11, 60, 6, 94, 66, 126, 124, 100, 115, 66],
        tileName: {0: "city_4"},
        timeNextRest: function () {
            return TimeRest.restEvery12();
        }
    },
    "32": {
        snapShoot: "front_squad.png",
        ar_title: "الفرقة الامامية",
        prom_lvl: 3,
        fitness: 40,
        make_req: ["truce_pack"],
        join_req: [""],
        desc: `
            مرحبا بكم في فتح باب الدم. ثق بي ، هذه مجرد البداية.

            بعد سلسلة من الحروب الطويلة ، أصبحت قوة قوات المتمردين في الجمهورية الرومانية أضعف وأضعف.
             النجاح الكبير لا يرجع فقط إلى تصميم مجلس الشيوخ ، ولكن أيضًا يرتبط ارتباطًا وثيقًا باستراتيجية عسكرية جديدة وافق عليها جميع قضاة المقاطعات سابقًا.
             وفقًا للاستراتيجية ، يلعب مجلس الشيوخ في الواقع لعبة القط والفأر مع المتمردين ، بهدف القضاء عليهم جميعًا في وقت واحد في المستقبل.
             هنا تأتي الفرصة الآن. لقد جمع المتمردون أخيرًا في الشمال الشرقي شديد البرودة كما هو متوقع.
             ومع ذلك ، فقد شكلوا مجموعة قوية للغاية تسمى محور الاستقلال وأعلنت Fearless Skullbearer كزعيم.
              Fearless Skullbearer هو مقاتلة حديدية الوحد الذي يوحد الغشاشين ويلهم قوات المتمردين. 
            مع نظر العالم إلى الشمال الشرقي للجمهورية الرومانية ، ينادي مجلس الشيوخ بهجوم عام ضد محور الاستقلال.`,

        getTitle: function (x_coord, y_coord) {
            return "الفرقة الامامية";
        },
        maxLvl: 40,
        hitArea: [63, 37, 11, 60, 6, 94, 66, 126, 124, 100, 115, 66],
        tileName: {0: "front_squad"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "33": {
        snapShoot: "front_squad.png",
        ar_title: "السرية الامامية",
        prom_lvl: 3,
        fitness: 40,
        make_req: ["truce_pack"],
        join_req: [""],
        desc: `
            مرحبا بكم في فتح باب الدم. ثق بي ، هذه مجرد البداية.

            بعد سلسلة من الحروب الطويلة ، أصبحت قوة قوات المتمردين في الجمهورية الرومانية أضعف وأضعف.
             النجاح الكبير لا يرجع فقط إلى تصميم مجلس الشيوخ ، ولكن أيضًا يرتبط ارتباطًا وثيقًا باستراتيجية عسكرية جديدة وافق عليها جميع قضاة المقاطعات سابقًا.
             وفقًا للاستراتيجية ، يلعب مجلس الشيوخ في الواقع لعبة القط والفأر مع المتمردين ، بهدف القضاء عليهم جميعًا في وقت واحد في المستقبل.
             هنا تأتي الفرصة الآن. لقد جمع المتمردون أخيرًا في الشمال الشرقي شديد البرودة كما هو متوقع.
             ومع ذلك ، فقد شكلوا مجموعة قوية للغاية تسمى محور الاستقلال وأعلنت Fearless Skullbearer كزعيم.
              Fearless Skullbearer هو مقاتلة حديدية الوحد الذي يوحد الغشاشين ويلهم قوات المتمردين. 
            مع نظر العالم إلى الشمال الشرقي للجمهورية الرومانية ، ينادي مجلس الشيوخ بهجوم عام ضد محور الاستقلال.`,

        getTitle: function (x_coord, y_coord) {
            return "السرية الامامية";
        },
        maxLvl: 40,
        hitArea: [63, 37, 11, 60, 6, 94, 66, 126, 124, 100, 115, 66],
        tileName: {0: "front_band"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "34": {
        snapShoot: "front_band.png",
        ar_title: "الجماعة الامامية",
        prom_lvl: 3,
        fitness: 40,
        make_req: ["truce_pack"],
        join_req: [""],
        desc: `
            مرحبا بكم في فتح باب الدم. ثق بي ، هذه مجرد البداية.

            بعد سلسلة من الحروب الطويلة ، أصبحت قوة قوات المتمردين في الجمهورية الرومانية أضعف وأضعف.
             النجاح الكبير لا يرجع فقط إلى تصميم مجلس الشيوخ ، ولكن أيضًا يرتبط ارتباطًا وثيقًا باستراتيجية عسكرية جديدة وافق عليها جميع قضاة المقاطعات سابقًا.
             وفقًا للاستراتيجية ، يلعب مجلس الشيوخ في الواقع لعبة القط والفأر مع المتمردين ، بهدف القضاء عليهم جميعًا في وقت واحد في المستقبل.
             هنا تأتي الفرصة الآن. لقد جمع المتمردون أخيرًا في الشمال الشرقي شديد البرودة كما هو متوقع.
             ومع ذلك ، فقد شكلوا مجموعة قوية للغاية تسمى محور الاستقلال وأعلنت Fearless Skullbearer كزعيم.
              Fearless Skullbearer هو مقاتلة حديدية الوحد الذي يوحد الغشاشين ويلهم قوات المتمردين. 
            مع نظر العالم إلى الشمال الشرقي للجمهورية الرومانية ، ينادي مجلس الشيوخ بهجوم عام ضد محور الاستقلال.`,

        getTitle: function (x_coord, y_coord) {
            return "الجماعة الامامية";
        },
        maxLvl: 40,
        hitArea: [63, 37, 11, 60, 6, 94, 66, 126, 124, 100, 115, 66],
        tileName: {0: "front_squadron"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "35": {
        snapShoot: "front_division.png",
        ar_title: "الكتيبة الامامية",
        prom_lvl: 3,
        fitness: 40,
        make_req: ["truce_pack"],
        join_req: [""],
        getTitle: function (x_coord, y_coord) {
            return "الكتيبة الامامية";
        },
        desc: `
            مرحبا بكم في فتح باب الدم. ثق بي ، هذه مجرد البداية.

            بعد سلسلة من الحروب الطويلة ، أصبحت قوة قوات المتمردين في الجمهورية الرومانية أضعف وأضعف.
             النجاح الكبير لا يرجع فقط إلى تصميم مجلس الشيوخ ، ولكن أيضًا يرتبط ارتباطًا وثيقًا باستراتيجية عسكرية جديدة وافق عليها جميع قضاة المقاطعات سابقًا.
             وفقًا للاستراتيجية ، يلعب مجلس الشيوخ في الواقع لعبة القط والفأر مع المتمردين ، بهدف القضاء عليهم جميعًا في وقت واحد في المستقبل.
             هنا تأتي الفرصة الآن. لقد جمع المتمردون أخيرًا في الشمال الشرقي شديد البرودة كما هو متوقع.
             ومع ذلك ، فقد شكلوا مجموعة قوية للغاية تسمى محور الاستقلال وأعلنت Fearless Skullbearer كزعيم.
              Fearless Skullbearer هو مقاتلة حديدية الوحد الذي يوحد الغشاشين ويلهم قوات المتمردين. 
            مع نظر العالم إلى الشمال الشرقي للجمهورية الرومانية ، ينادي مجلس الشيوخ بهجوم عام ضد محور الاستقلال.`,

        maxLvl: 40,
        hitArea: [63, 37, 11, 60, 6, 94, 66, 126, 124, 100, 115, 66],
        tileName: {0: "front_division"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "36": {
        snapShoot: "armed_light_squad.png",
        ar_title: "فرقة التسليح الخفيف",
        prom_lvl: 10,
        fitness: 40,
        make_req: ["truce_pack"],
        join_req: [""],
        getTitle: function (x_coord, y_coord) {
            return "فرقة التسليح الخفيف";
        },
        desc: `
            مرحبا بكم في فتح باب الدم. ثق بي ، هذه مجرد البداية.

            بعد سلسلة من الحروب الطويلة ، أصبحت قوة قوات المتمردين في الجمهورية الرومانية أضعف وأضعف.
             النجاح الكبير لا يرجع فقط إلى تصميم مجلس الشيوخ ، ولكن أيضًا يرتبط ارتباطًا وثيقًا باستراتيجية عسكرية جديدة وافق عليها جميع قضاة المقاطعات سابقًا.
             وفقًا للاستراتيجية ، يلعب مجلس الشيوخ في الواقع لعبة القط والفأر مع المتمردين ، بهدف القضاء عليهم جميعًا في وقت واحد في المستقبل.
             هنا تأتي الفرصة الآن. لقد جمع المتمردون أخيرًا في الشمال الشرقي شديد البرودة كما هو متوقع.
             ومع ذلك ، فقد شكلوا مجموعة قوية للغاية تسمى محور الاستقلال وأعلنت Fearless Skullbearer كزعيم.
              Fearless Skullbearer هو مقاتلة حديدية الوحد الذي يوحد الغشاشين ويلهم قوات المتمردين. 
            مع نظر العالم إلى الشمال الشرقي للجمهورية الرومانية ، ينادي مجلس الشيوخ بهجوم عام ضد محور الاستقلال.`,

        maxLvl: 30,
        hitArea: [63, 37, 11, 60, 6, 94, 66, 126, 124, 100, 115, 66],
        tileName: {0: "armed_light_squad"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "37": {
        snapShoot: "armed_light_band.png",
        ar_title: "سرية التسليح الخفيف",
        prom_lvl: 10,
        fitness: 40,
        make_req: ["truce_pack"],
        join_req: [""],
        getTitle: function (x_coord, y_coord) {
            return "سرية التسليح الخفيف";
        },
        desc: `
            مرحبا بكم في فتح باب الدم. ثق بي ، هذه مجرد البداية.

            بعد سلسلة من الحروب الطويلة ، أصبحت قوة قوات المتمردين في الجمهورية الرومانية أضعف وأضعف.
             النجاح الكبير لا يرجع فقط إلى تصميم مجلس الشيوخ ، ولكن أيضًا يرتبط ارتباطًا وثيقًا باستراتيجية عسكرية جديدة وافق عليها جميع قضاة المقاطعات سابقًا.
             وفقًا للاستراتيجية ، يلعب مجلس الشيوخ في الواقع لعبة القط والفأر مع المتمردين ، بهدف القضاء عليهم جميعًا في وقت واحد في المستقبل.
             هنا تأتي الفرصة الآن. لقد جمع المتمردون أخيرًا في الشمال الشرقي شديد البرودة كما هو متوقع.
             ومع ذلك ، فقد شكلوا مجموعة قوية للغاية تسمى محور الاستقلال وأعلنت Fearless Skullbearer كزعيم.
              Fearless Skullbearer هو مقاتلة حديدية الوحد الذي يوحد الغشاشين ويلهم قوات المتمردين. 
            مع نظر العالم إلى الشمال الشرقي للجمهورية الرومانية ، ينادي مجلس الشيوخ بهجوم عام ضد محور الاستقلال.`,

        maxLvl: 30,
        hitArea: [63, 37, 11, 60, 6, 94, 66, 126, 124, 100, 115, 66],
        tileName: {0: "armed_light_band"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "38": {
        snapShoot: "armed_light_squadron.png",
        ar_title: "جماعة التسليح الخفيف",
        prom_lvl: 10,
        fitness: 40,
        make_req: ["truce_pack"],
        join_req: [""],
        getTitle: function (x_coord, y_coord) {
            return "جماعة التسليح الخفيف";
        },
        desc: `
            مرحبا بكم في فتح باب الدم. ثق بي ، هذه مجرد البداية.

            بعد سلسلة من الحروب الطويلة ، أصبحت قوة قوات المتمردين في الجمهورية الرومانية أضعف وأضعف.
             النجاح الكبير لا يرجع فقط إلى تصميم مجلس الشيوخ ، ولكن أيضًا يرتبط ارتباطًا وثيقًا باستراتيجية عسكرية جديدة وافق عليها جميع قضاة المقاطعات سابقًا.
             وفقًا للاستراتيجية ، يلعب مجلس الشيوخ في الواقع لعبة القط والفأر مع المتمردين ، بهدف القضاء عليهم جميعًا في وقت واحد في المستقبل.
             هنا تأتي الفرصة الآن. لقد جمع المتمردون أخيرًا في الشمال الشرقي شديد البرودة كما هو متوقع.
             ومع ذلك ، فقد شكلوا مجموعة قوية للغاية تسمى محور الاستقلال وأعلنت Fearless Skullbearer كزعيم.
              Fearless Skullbearer هو مقاتلة حديدية الوحد الذي يوحد الغشاشين ويلهم قوات المتمردين. 
            مع نظر العالم إلى الشمال الشرقي للجمهورية الرومانية ، ينادي مجلس الشيوخ بهجوم عام ضد محور الاستقلال.`,

        maxLvl: 30,
        hitArea: [63, 37, 11, 60, 6, 94, 66, 126, 124, 100, 115, 66],
        tileName: {0: "armed_light_squadron"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "39": {
        snapShoot: "armed_light_division.png",
        ar_title: "كتيبة التسليح الخفيف",
        prom_lvl: 10,
        fitness: 40,
        make_req: ["truce_pack"],
        join_req: [""],
        getTitle: function (x_coord, y_coord) {
            return "كتيبة التسليح الخفيف";
        },
        desc: `
            مرحبا بكم في فتح باب الدم. ثق بي ، هذه مجرد البداية.

            بعد سلسلة من الحروب الطويلة ، أصبحت قوة قوات المتمردين في الجمهورية الرومانية أضعف وأضعف.
             النجاح الكبير لا يرجع فقط إلى تصميم مجلس الشيوخ ، ولكن أيضًا يرتبط ارتباطًا وثيقًا باستراتيجية عسكرية جديدة وافق عليها جميع قضاة المقاطعات سابقًا.
             وفقًا للاستراتيجية ، يلعب مجلس الشيوخ في الواقع لعبة القط والفأر مع المتمردين ، بهدف القضاء عليهم جميعًا في وقت واحد في المستقبل.
             هنا تأتي الفرصة الآن. لقد جمع المتمردون أخيرًا في الشمال الشرقي شديد البرودة كما هو متوقع.
             ومع ذلك ، فقد شكلوا مجموعة قوية للغاية تسمى محور الاستقلال وأعلنت Fearless Skullbearer كزعيم.
              Fearless Skullbearer هو مقاتلة حديدية الوحد الذي يوحد الغشاشين ويلهم قوات المتمردين. 
            مع نظر العالم إلى الشمال الشرقي للجمهورية الرومانية ، ينادي مجلس الشيوخ بهجوم عام ضد محور الاستقلال.`,

        maxLvl: 30,
        hitArea: [63, 37, 11, 60, 6, 94, 66, 126, 124, 100, 115, 66],
        tileName: {0: "armed_light_division"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "40": {
        snapShoot: "armed_heavy_squad.png",
        ar_title: "فرقة التسليح الثقيل",
        prom_lvl: 20,
        fitness: 40,
        make_req: ["truce_pack"],
        join_req: [""],
        getTitle: function (x_coord, y_coord) {
            return "فرقة التسليح الثقيل";
        },
        desc: `
            مرحبا بكم في فتح باب الدم. ثق بي ، هذه مجرد البداية.

            بعد سلسلة من الحروب الطويلة ، أصبحت قوة قوات المتمردين في الجمهورية الرومانية أضعف وأضعف.
             النجاح الكبير لا يرجع فقط إلى تصميم مجلس الشيوخ ، ولكن أيضًا يرتبط ارتباطًا وثيقًا باستراتيجية عسكرية جديدة وافق عليها جميع قضاة المقاطعات سابقًا.
             وفقًا للاستراتيجية ، يلعب مجلس الشيوخ في الواقع لعبة القط والفأر مع المتمردين ، بهدف القضاء عليهم جميعًا في وقت واحد في المستقبل.
             هنا تأتي الفرصة الآن. لقد جمع المتمردون أخيرًا في الشمال الشرقي شديد البرودة كما هو متوقع.
             ومع ذلك ، فقد شكلوا مجموعة قوية للغاية تسمى محور الاستقلال وأعلنت Fearless Skullbearer كزعيم.
              Fearless Skullbearer هو مقاتلة حديدية الوحد الذي يوحد الغشاشين ويلهم قوات المتمردين. 
            مع نظر العالم إلى الشمال الشرقي للجمهورية الرومانية ، ينادي مجلس الشيوخ بهجوم عام ضد محور الاستقلال.`,

        maxLvl: 20,
        hitArea: [63, 37, 11, 60, 6, 94, 66, 126, 124, 100, 115, 66],
        tileName: {0: "armed_heavy_squad"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "41": {
        snapShoot: "armed_heavy_band.png",
        ar_title: "سرية التسليح الثقيل",
        prom_lvl: 20,
        fitness: 40,
        make_req: ["truce_pack"],
        join_req: [""],
        getTitle: function (x_coord, y_coord) {
            return "سرية التسليح الثقيل";
        },
        desc: `
            مرحبا بكم في فتح باب الدم. ثق بي ، هذه مجرد البداية.

            بعد سلسلة من الحروب الطويلة ، أصبحت قوة قوات المتمردين في الجمهورية الرومانية أضعف وأضعف.
             النجاح الكبير لا يرجع فقط إلى تصميم مجلس الشيوخ ، ولكن أيضًا يرتبط ارتباطًا وثيقًا باستراتيجية عسكرية جديدة وافق عليها جميع قضاة المقاطعات سابقًا.
             وفقًا للاستراتيجية ، يلعب مجلس الشيوخ في الواقع لعبة القط والفأر مع المتمردين ، بهدف القضاء عليهم جميعًا في وقت واحد في المستقبل.
             هنا تأتي الفرصة الآن. لقد جمع المتمردون أخيرًا في الشمال الشرقي شديد البرودة كما هو متوقع.
             ومع ذلك ، فقد شكلوا مجموعة قوية للغاية تسمى محور الاستقلال وأعلنت Fearless Skullbearer كزعيم.
              Fearless Skullbearer هو مقاتلة حديدية الوحد الذي يوحد الغشاشين ويلهم قوات المتمردين. 
            مع نظر العالم إلى الشمال الشرقي للجمهورية الرومانية ، ينادي مجلس الشيوخ بهجوم عام ضد محور الاستقلال.`,

        maxLvl: 20,
        hitArea: [63, 37, 11, 60, 6, 94, 66, 126, 124, 100, 115, 66],
        tileName: {0: "armed_heavy_band"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "42": {
        snapShoot: "armed_heavy_squadron.png",
        ar_title: "جماعة التسليح الثقيل",
        prom_lvl: 20,
        fitness: 40,
        make_req: ["truce_pack"],
        join_req: [""],
        getTitle: function (x_coord, y_coord) {
            return "جماعة التسليح الثقيل";
        },
        desc: `
            مرحبا بكم في فتح باب الدم. ثق بي ، هذه مجرد البداية.

            بعد سلسلة من الحروب الطويلة ، أصبحت قوة قوات المتمردين في الجمهورية الرومانية أضعف وأضعف.
             النجاح الكبير لا يرجع فقط إلى تصميم مجلس الشيوخ ، ولكن أيضًا يرتبط ارتباطًا وثيقًا باستراتيجية عسكرية جديدة وافق عليها جميع قضاة المقاطعات سابقًا.
             وفقًا للاستراتيجية ، يلعب مجلس الشيوخ في الواقع لعبة القط والفأر مع المتمردين ، بهدف القضاء عليهم جميعًا في وقت واحد في المستقبل.
             هنا تأتي الفرصة الآن. لقد جمع المتمردون أخيرًا في الشمال الشرقي شديد البرودة كما هو متوقع.
             ومع ذلك ، فقد شكلوا مجموعة قوية للغاية تسمى محور الاستقلال وأعلنت Fearless Skullbearer كزعيم.
              Fearless Skullbearer هو مقاتلة حديدية الوحد الذي يوحد الغشاشين ويلهم قوات المتمردين. 
            مع نظر العالم إلى الشمال الشرقي للجمهورية الرومانية ، ينادي مجلس الشيوخ بهجوم عام ضد محور الاستقلال.`,

        maxLvl: 20,
        hitArea: [63, 37, 11, 60, 6, 94, 66, 126, 124, 100, 115, 66],
        tileName: {0: "armed_heavy_squadron"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "43": {
        snapShoot: "armed_heavy_division.png",
        ar_title: "كتيبة التسليح الثقيل",
        prom_lvl: 20,
        fitness: 40,
        make_req: ["truce_pack"],
        join_req: [""],
        getTitle: function (x_coord, y_coord) {
            return "كتيبة التسليح الثقيل";
        },
        desc: `
            مرحبا بكم في فتح باب الدم. ثق بي ، هذه مجرد البداية.

            بعد سلسلة من الحروب الطويلة ، أصبحت قوة قوات المتمردين في الجمهورية الرومانية أضعف وأضعف.
             النجاح الكبير لا يرجع فقط إلى تصميم مجلس الشيوخ ، ولكن أيضًا يرتبط ارتباطًا وثيقًا باستراتيجية عسكرية جديدة وافق عليها جميع قضاة المقاطعات سابقًا.
             وفقًا للاستراتيجية ، يلعب مجلس الشيوخ في الواقع لعبة القط والفأر مع المتمردين ، بهدف القضاء عليهم جميعًا في وقت واحد في المستقبل.
             هنا تأتي الفرصة الآن. لقد جمع المتمردون أخيرًا في الشمال الشرقي شديد البرودة كما هو متوقع.
             ومع ذلك ، فقد شكلوا مجموعة قوية للغاية تسمى محور الاستقلال وأعلنت Fearless Skullbearer كزعيم.
              Fearless Skullbearer هو مقاتلة حديدية الوحد الذي يوحد الغشاشين ويلهم قوات المتمردين. 
            مع نظر العالم إلى الشمال الشرقي للجمهورية الرومانية ، ينادي مجلس الشيوخ بهجوم عام ضد محور الاستقلال.`,

        maxLvl: 20,
        hitArea: [63, 37, 11, 60, 6, 94, 66, 126, 124, 100, 115, 66],
        tileName: {0: "armed_heavy_division"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "44": {
        snapShoot: "guard_squad.png",
        ar_title: "فرقة الحراسة",
        prom_lvl: 25,
        fitness: 40,
        make_req: ["truce_pack"],
        join_req: [""],
        getTitle: function (x_coord, y_coord) {
            return "فرقة الحراسة";
        },
        desc: `
            مرحبا بكم في فتح باب الدم. ثق بي ، هذه مجرد البداية.

            بعد سلسلة من الحروب الطويلة ، أصبحت قوة قوات المتمردين في الجمهورية الرومانية أضعف وأضعف.
             النجاح الكبير لا يرجع فقط إلى تصميم مجلس الشيوخ ، ولكن أيضًا يرتبط ارتباطًا وثيقًا باستراتيجية عسكرية جديدة وافق عليها جميع قضاة المقاطعات سابقًا.
             وفقًا للاستراتيجية ، يلعب مجلس الشيوخ في الواقع لعبة القط والفأر مع المتمردين ، بهدف القضاء عليهم جميعًا في وقت واحد في المستقبل.
             هنا تأتي الفرصة الآن. لقد جمع المتمردون أخيرًا في الشمال الشرقي شديد البرودة كما هو متوقع.
             ومع ذلك ، فقد شكلوا مجموعة قوية للغاية تسمى محور الاستقلال وأعلنت Fearless Skullbearer كزعيم.
              Fearless Skullbearer هو مقاتلة حديدية الوحد الذي يوحد الغشاشين ويلهم قوات المتمردين. 
            مع نظر العالم إلى الشمال الشرقي للجمهورية الرومانية ، ينادي مجلس الشيوخ بهجوم عام ضد محور الاستقلال.`,

        maxLvl: 20,
        hitArea: [63, 37, 11, 60, 6, 94, 66, 126, 124, 100, 115, 66],
        tileName: {0: "guard_squad"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "45": {
        snapShoot: "guard_band.png",
        ar_title: "سرية الحراسة",
        prom_lvl: 25,
        fitness: 40,
        make_req: ["truce_pack"],
        join_req: [""],
        getTitle: function (x_coord, y_coord) {
            return "سرية الحراسة";
        },
        desc: `
            مرحبا بكم في فتح باب الدم. ثق بي ، هذه مجرد البداية.

            بعد سلسلة من الحروب الطويلة ، أصبحت قوة قوات المتمردين في الجمهورية الرومانية أضعف وأضعف.
             النجاح الكبير لا يرجع فقط إلى تصميم مجلس الشيوخ ، ولكن أيضًا يرتبط ارتباطًا وثيقًا باستراتيجية عسكرية جديدة وافق عليها جميع قضاة المقاطعات سابقًا.
             وفقًا للاستراتيجية ، يلعب مجلس الشيوخ في الواقع لعبة القط والفأر مع المتمردين ، بهدف القضاء عليهم جميعًا في وقت واحد في المستقبل.
             هنا تأتي الفرصة الآن. لقد جمع المتمردون أخيرًا في الشمال الشرقي شديد البرودة كما هو متوقع.
             ومع ذلك ، فقد شكلوا مجموعة قوية للغاية تسمى محور الاستقلال وأعلنت Fearless Skullbearer كزعيم.
              Fearless Skullbearer هو مقاتلة حديدية الوحد الذي يوحد الغشاشين ويلهم قوات المتمردين. 
            مع نظر العالم إلى الشمال الشرقي للجمهورية الرومانية ، ينادي مجلس الشيوخ بهجوم عام ضد محور الاستقلال.`,

        maxLvl: 20,
        hitArea: [63, 37, 11, 60, 6, 94, 66, 126, 124, 100, 115, 66],
        tileName: {0: "guard_band"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "46": {
        snapShoot: "guard_squadron.png",
        ar_title: "جماعة الحراسة",
        prom_lvl: 25,
        fitness: 40,
        make_req: ["truce_pack"],
        join_req: [""],
        getTitle: function (x_coord, y_coord) {
            return "جماعة الحراسة";
        },
        desc: `
            مرحبا بكم في فتح باب الدم. ثق بي ، هذه مجرد البداية.

            بعد سلسلة من الحروب الطويلة ، أصبحت قوة قوات المتمردين في الجمهورية الرومانية أضعف وأضعف.
             النجاح الكبير لا يرجع فقط إلى تصميم مجلس الشيوخ ، ولكن أيضًا يرتبط ارتباطًا وثيقًا باستراتيجية عسكرية جديدة وافق عليها جميع قضاة المقاطعات سابقًا.
             وفقًا للاستراتيجية ، يلعب مجلس الشيوخ في الواقع لعبة القط والفأر مع المتمردين ، بهدف القضاء عليهم جميعًا في وقت واحد في المستقبل.
             هنا تأتي الفرصة الآن. لقد جمع المتمردون أخيرًا في الشمال الشرقي شديد البرودة كما هو متوقع.
             ومع ذلك ، فقد شكلوا مجموعة قوية للغاية تسمى محور الاستقلال وأعلنت Fearless Skullbearer كزعيم.
              Fearless Skullbearer هو مقاتلة حديدية الوحد الذي يوحد الغشاشين ويلهم قوات المتمردين. 
            مع نظر العالم إلى الشمال الشرقي للجمهورية الرومانية ، ينادي مجلس الشيوخ بهجوم عام ضد محور الاستقلال.`,

        maxLvl: 20,
        hitArea: [63, 37, 11, 60, 6, 94, 66, 126, 124, 100, 115, 66],
        tileName: {0: "guard_squadron"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "47": {
        snapShoot: "guard_division.png",
        ar_title: "كتيبة الحراسة",
        prom_lvl: 25,
        fitness: 40,
        make_req: ["truce_pack"],
        join_req: [""],
        getTitle: function (x_coord, y_coord) {
            return "كتيبة الحراسة";
        },
        desc: `
            مرحبا بكم في فتح باب الدم. ثق بي ، هذه مجرد البداية.

            بعد سلسلة من الحروب الطويلة ، أصبحت قوة قوات المتمردين في الجمهورية الرومانية أضعف وأضعف.
             النجاح الكبير لا يرجع فقط إلى تصميم مجلس الشيوخ ، ولكن أيضًا يرتبط ارتباطًا وثيقًا باستراتيجية عسكرية جديدة وافق عليها جميع قضاة المقاطعات سابقًا.
             وفقًا للاستراتيجية ، يلعب مجلس الشيوخ في الواقع لعبة القط والفأر مع المتمردين ، بهدف القضاء عليهم جميعًا في وقت واحد في المستقبل.
             هنا تأتي الفرصة الآن. لقد جمع المتمردون أخيرًا في الشمال الشرقي شديد البرودة كما هو متوقع.
             ومع ذلك ، فقد شكلوا مجموعة قوية للغاية تسمى محور الاستقلال وأعلنت Fearless Skullbearer كزعيم.
              Fearless Skullbearer هو مقاتلة حديدية الوحد الذي يوحد الغشاشين ويلهم قوات المتمردين. 
            مع نظر العالم إلى الشمال الشرقي للجمهورية الرومانية ، ينادي مجلس الشيوخ بهجوم عام ضد محور الاستقلال.`,

        maxLvl: 20,
        hitArea: [63, 37, 11, 60, 6, 94, 66, 126, 124, 100, 115, 66],
        tileName: {0: "guard_division"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "48": {
        snapShoot: "thunder.png",
        ar_title: "الساندرز",
        prom_lvl: 29,
        fitness: 40,
        make_req: ["truce_pack"],
        join_req: [""],
        getTitle: function (x_coord, y_coord) {
            return "الساندرز الشجاع";
        },
        desc: `
            مرحبا بكم في فتح باب الدم. ثق بي ، هذه مجرد البداية.

            بعد سلسلة من الحروب الطويلة ، أصبحت قوة قوات المتمردين في الجمهورية الرومانية أضعف وأضعف.
             النجاح الكبير لا يرجع فقط إلى تصميم مجلس الشيوخ ، ولكن أيضًا يرتبط ارتباطًا وثيقًا باستراتيجية عسكرية جديدة وافق عليها جميع قضاة المقاطعات سابقًا.
             وفقًا للاستراتيجية ، يلعب مجلس الشيوخ في الواقع لعبة القط والفأر مع المتمردين ، بهدف القضاء عليهم جميعًا في وقت واحد في المستقبل.
             هنا تأتي الفرصة الآن. لقد جمع المتمردون أخيرًا في الشمال الشرقي شديد البرودة كما هو متوقع.
             ومع ذلك ، فقد شكلوا مجموعة قوية للغاية تسمى محور الاستقلال وأعلنت Fearless Skullbearer كزعيم.
              Fearless Skullbearer هو مقاتلة حديدية الوحد الذي يوحد الغشاشين ويلهم قوات المتمردين. 
            مع نظر العالم إلى الشمال الشرقي للجمهورية الرومانية ، ينادي مجلس الشيوخ بهجوم عام ضد محور الاستقلال.`,

        maxLvl: 10,
        hitArea: [63, 37, 11, 60, 6, 94, 66, 126, 124, 100, 115, 66],
        tileName: {0: "brave_thunder"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "49": {
        snapShoot: "gang.png",
        ar_title: "العصابات",
        prom_lvl: 1,
        fitness: 20,
        make_req: ["t_map"],
        join_req: [""],
        getTitle: function (x_coord, y_coord) {
            return "العصابات";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 2,
        hitArea: [63, 37, 11, 60, 6, 94, 66, 126, 124, 100, 115, 66],
        tileName: {0: "gang"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "50": {
        snapShoot: "mugger.png",
        ar_title: "قطاع الطرق",
        prom_lvl: 1,
        fitness: 20,
        make_req: ["t_map"],
        join_req: [""],
        getTitle: function (x_coord, y_coord) {
            return "قطاع الطريق";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 2,
        hitArea: [63, 37, 11, 60, 6, 94, 66, 126, 124, 100, 115, 66],
        tileName: {0: "mugger"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "51": {
        snapShoot: "thief.png",
        ar_title: "اللصوص",
        prom_lvl: 1,
        fitness: 20,
        make_req: ["t_map"],
        join_req: [""],
        getTitle: function (x_coord, y_coord) {
            return "اللصوص";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 2,
        hitArea: [63, 37, 11, 60, 6, 94, 66, 126, 124, 100, 115, 66],
        tileName: {0: "thief"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "52": {
        snapShoot: "c_gang.png",
        ar_title: "العصابات القرطاجية",
        prom_lvl: 4,
        fitness: 20,
        make_req: ["repel_trumpet_1"],
        join_req: [""],
        getTitle: function (x_coord, y_coord) {
            return "العصابات القرطاجية";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 10,
        hitArea: [69, 110, 90, 101, 90, 69, 63, 53, 42, 64, 41, 97],
        tileName: {0: "carthage_gang"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "53": {
        snapShoot: "c_teams.png",
        ar_title: "فرق العصيان القرطاجى",
        prom_lvl: 1,
        fitness: 30,
        make_req: ["repel_trumpet_1"],
        join_req: [""],
        getTitle: function (x_coord, y_coord) {
            return "فرق العصيان القرطاجى";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 10,
        hitArea: [63, 112, 97, 96, 94, 71, 65, 54, 35, 68, 34, 98],
        tileName: {0: "carthage_teams"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "54": {
        snapShoot: "c_rebels.png",
        ar_title: "متمردى قرطاجة",
        prom_lvl: 7,
        fitness: 40,
        make_req: ["repel_trumpet_2"],
        join_req: ["repel_trumpet_2"],
        getTitle: function (x_coord, y_coord) {
            return "متمردى قرطاجة";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 10,
        hitArea: [69, 115, 104, 102, 97, 68, 61, 48, 34, 64, 31, 98],
        tileName: {0: "carthage_rebels"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "55": {
        snapShoot: "c_forces.png",
        ar_title: "القوات الخاصة القرطاجية",
        prom_lvl: 14,
        fitness: 50,
        make_req: ["repel_trumpet_2"],
        join_req: ["repel_trumpet_2"],
        getTitle: function (x_coord, y_coord) {
            return "القوات الخاصة القرطاجية";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 10,
        hitArea: [67, 116, 110, 100, 101, 67, 69, 47, 31, 65, 29, 100],
        tileName: {0: "carthage_forces"},
        timeNextRest: function () {
            return TimeRest.restEvery6();
        }
    },
    "56": {
        snapShoot: "c_capital.png",
        ar_title: "عاصمة التمرد",
        prom_lvl: 19,
        fitness: 60,
        make_req: ["repel_medal"],
        join_req: ["repel_medal"],
        getTitle: function (x_coord, y_coord) {
            return "عاصمة التمرد";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 10,
        hitArea: [62, 116, 108, 97, 102, 67, 71, 46, 29, 64, 27, 98],
        tileName: {0: "carthage_capital"},
        timeNextRest: function () {
            return TimeRest.restEvery12();
        }
    },
    "100": {
        snapShoot: "armyCapital.png",
        ar_title: "عاصمة المشاة",
        prom_lvl: 1,
        fitness: 50,
        make_req: ["warrior_medal"],
        join_req: [],
        hero_army_req: 1,
        getTitle: function (x_coord, y_coord) {
            return "عاصمة المشاة";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 10,
        hitArea: [81, 30, 39, 32, 26, 110, 62, 129, 106, 118],
        tileName: {0: "army_capital"},
        timeNextRest: function () {
            return TimeRest.restEvery12();
        }
    },
    "101": {
        snapShoot: "armyCapital.png",
        ar_title: "عاصمة الفرسان",
        prom_lvl: 1,
        fitness: 50,
        hero_army_req: 2,
        make_req: ["warrior_medal"],
        join_req: [],
        getTitle: function (x_coord, y_coord) {
            return "عاصمة الفرسان";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 10,
        hitArea: [81, 30, 39, 32, 26, 110, 62, 129, 106, 118],
        tileName: {0: "army_capital"},
        timeNextRest: function () {
            return TimeRest.restEvery12();
        }
    },
    "102": {
        snapShoot: "armyCapital.png",
        ar_title: "عاصمة المدرعين",
        prom_lvl: 1,
        fitness: 50,
        hero_army_req: 3,
        make_req: ["warrior_medal"],
        join_req: [],
        getTitle: function (x_coord, y_coord) {
            return "عاصمة المدرعين";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 10,
        hitArea: [81, 30, 39, 32, 26, 110, 62, 129, 106, 118],
        tileName: {0: "army_capital"},
        timeNextRest: function () {
            return TimeRest.restEvery12();
        }
    },
    "103": {
        snapShoot: "armyCapital.png",
        ar_title: "عاصمة رماة السهم",
        prom_lvl: 1,
        fitness: 50,
        hero_army_req: 4,
        make_req: ["warrior_medal"],
        join_req: [],
        getTitle: function (x_coord, y_coord) {
            return "عاصمة رماة السهم";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 10,
        hitArea: [81, 30, 39, 32, 26, 110, 62, 129, 106, 118],
        tileName: {0: "army_capital"},
        timeNextRest: function () {
            return TimeRest.restEvery12();
        }
    },
    "104": {
        snapShoot: "armyCapital.png",
        ar_title: "عاصمة المقاليعٍ",
        prom_lvl: 1,
        fitness: 50,
        hero_army_req: 5,
        make_req: ["warrior_medal"],
        join_req: [],
        getTitle: function (x_coord, y_coord) {
            return "عاصمة المقاليع";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 10,
        hitArea: [81, 30, 39, 32, 26, 110, 62, 129, 106, 118],
        tileName: {0: "army_capital"},
        timeNextRest: function () {
            return TimeRest.restEvery12();
        }
    },
    "105": {
        snapShoot: "armyCapital.png",
        ar_title: "عاصمة المنجنيق",
        prom_lvl: 1,
        fitness: 50,
        hero_army_req: 6,
        make_req: ["warrior_medal"],
        join_req: [],
        getTitle: function (x_coord, y_coord) {
            return "عاصمة المنجنيق";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 10,
        hitArea: [81, 30, 39, 32, 26, 110, 62, 129, 106, 118],
        tileName: {0: "army_capital"},
        timeNextRest: function () {
            return TimeRest.restEvery12();
        }
    },
    "125": {
        snapShoot: "arena.png",
        ar_title: "حلبة التحدى",
        prom_lvl: 1,
        fitness: 10,
        make_req: [],
        join_req: [],
        getTitle: function (x_coord, y_coord) {
            return "حلبة التحدى";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 10,
        hitArea: [81, 30, 39, 32, 26, 110, 62, 129, 106, 118],
        tileName: {0: "arena"},
        timeNextRest: function () {
            return TimeRest.restEvery12();
        }
    },
    "126": {
        snapShoot: "arena.png",
        ar_title: "حلبة الموت",
        prom_lvl: 1,
        fitness: 10,
        make_req: [],
        join_req: [],
        getTitle: function (x_coord, y_coord) {
            return "حلبة الموت";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 10,
        hitArea: [81, 30, 39, 32, 26, 110, 62, 129, 106, 118],
        tileName: {0: "arena"},
        timeNextRest: function () {
            return TimeRest.restEvery12();
        }
    },
    "127": {
        snapShoot: "arena.png",
        ar_title: "حلبة تحدى الاحلاف",
        prom_lvl: 1,
        fitness: 10,
        make_req: [],
        join_req: [],
        getTitle: function (x_coord, y_coord) {
            return "حلبة تحدى الاحلاف";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 10,
        hitArea: [81, 30, 39, 32, 26, 110, 62, 129, 106, 118],
        tileName: {0: "arena"},
        timeNextRest: function () {
            return TimeRest.restEvery12();
        }
    },
    "130": {
        snapShoot: "queenCityS.png",
        ar_title: "الملكة الصغرى",
        prom_lvl: 3,
        fitness: 40,
        make_req: ["bronze_horn"],
        join_req: ["bronze_horn"],
        getTitle: function (x_coord, y_coord) {
            return "الملكة الصغرى";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 10,
        hitArea: [81, 30, 39, 32, 26, 110, 62, 129, 106, 118],
        tileName: {0: "queenCity_1"},
        timeNextRest: function () {
            return TimeRest.restEvery12();
        }
    },
    "131": {
        snapShoot: "queenCityM.png",
        ar_title: "الملكة الوسطى",
        prom_lvl: 4,
        fitness: 50,
        make_req: ["silver_horn"],
        join_req: ["silver_horn"],
        getTitle: function (x_coord, y_coord) {
            return "الملكة الصغرى";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 10,
        hitArea: [81, 30, 39, 32, 26, 110, 62, 129, 106, 118],
        tileName: {0: "queenCity_2"},
        timeNextRest: function () {
            return TimeRest.restEvery12();
        }
    },
    "132": {
        snapShoot: "queenCityH.png",
        ar_title: "الملكة الكبرى",
        prom_lvl: 5,
        fitness: 60,
        make_req: ["gold_horn"],
        join_req: ["gold_horn"],
        getTitle: function (x_coord, y_coord) {
            return "الملكة الصغرى";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 10,
        hitArea: [81, 30, 39, 32, 26, 110, 62, 129, 106, 118],
        tileName: {0: "queenCity_3"},
        timeNextRest: function () {
            return TimeRest.restEvery12();
        }
    },
    "134": {
        snapShoot: "repleCastleS.png",
        ar_title: "القلاع الصغرى",
        prom_lvl: 3,
        fitness: 40,
        make_req: ["bronze_horn"],
        join_req: ["bronze_horn"],
        getTitle: function (x_coord, y_coord) {
            return "القلاع الصغرى";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 10,
        hitArea: [81, 30, 39, 32, 26, 110, 62, 129, 106, 118],
        tileName: {0: "repleCastle_1"},
        timeNextRest: function () {
            return TimeRest.restEvery12();
        }
    },
    "135": {
        snapShoot: "repleCastleM.png",
        ar_title: "القلاع الوسطى",
        prom_lvl: 4,
        fitness: 50,
        make_req: ["silver_horn"],
        join_req: ["silver_horn"],
        getTitle: function (x_coord, y_coord) {
            return "القلاع الوسطى";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 10,
        hitArea: [81, 30, 39, 32, 26, 110, 62, 129, 106, 118],
        tileName: {0: "repleCastle_2"},
        timeNextRest: function () {
            return TimeRest.restEvery12();
        }
    },
    "136": {
        snapShoot: "repleCastleH.png",
        ar_title: "القلاع الكبرى",
        prom_lvl: 5,
        fitness: 60,
        make_req: ["gold_horn"],
        join_req: ["gold_horn"],
        getTitle: function (x_coord, y_coord) {
            return "القلاع الكبرى";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 10,
        hitArea: [81, 30, 39, 32, 26, 110, 62, 129, 106, 118],
        tileName: {0: "repleCastle_3"},
        timeNextRest: function () {
            return TimeRest.restEvery12();
        }
    },
    "150": {
        snapShoot: "statueWar_1.png",
        ar_title: "تمثال الحرب الاصغر",
        prom_lvl: 29,
        fitness: 100,
        make_req: ["evil_army_pass"],
        join_req: [],
        getTitle: function (x_coord, y_coord) {
            return "تمثال الحرب الاصغر";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 75,
        heroNum: 3,
        techLvl: 10,
        heroLvl: 255,
        hitArea: [33, 111, 56, 126, 85, 113, 78, 37, 53, 34],
        tileName: {0: "wolfStatue"},
        timeNextRest: function () {
            return TimeRest.restEvery12();
        }
    },
    "151": {
        snapShoot: "statueWar_2.png",
        ar_title: "تمثال الحرب الاوسط",
        prom_lvl: 29,
        fitness: 100,
        make_req: ["evil_army_pass"],
        join_req: [],
        getTitle: function (x_coord, y_coord) {
            return "تمثال الحرب الاوسط";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 50,
        heroNum: 3,
        techLvl: 10,
        heroLvl: 255,
        hitArea: [33, 111, 56, 126, 85, 113, 78, 37, 53, 34],
        tileName: {0: "wolfStatue"},
        timeNextRest: function () {
            return TimeRest.restEvery12();
        }
    },
    "152": {
        snapShoot: "statueWar_3.png",
        ar_title: "تمثال الحرب الاكبر",
        prom_lvl: 5,
        fitness: 60,
        make_req: ["evil_army_pass"],
        join_req: [],
        getTitle: function (x_coord, y_coord) {
            return "تمثال الحرب الاكبر";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 25,
        heroNum: 3,
        techLvl: 10,
        heroLvl: 255,
        hitArea: [33, 111, 56, 126, 85, 113, 78, 37, 53, 34],
        tileName: {0: "wolfStatue"},
        timeNextRest: function () {
            return TimeRest.restEvery12();
        }
    },
    "153": {
        snapShoot: "wolf_1.png",
        ar_title: "مجموعة الذئب 1",
        prom_lvl: 29,
        fitness: 100,
        make_req: ["evil_pass"],
        join_req: [],
        getTitle: function (x_coord, y_coord) {
            return "مجموعة الذئب 1";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 10,
        heroNum: 3,
        techLvl: 10,
        heroLvl: 255,
        hitArea: [33, 111, 56, 126, 85, 113, 78, 37, 53, 34],
        tileName: {0: "wolfStatue"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "154": {
        snapShoot: "wolf_2.png",
        ar_title: "مجموعة الذئب 2",
        prom_lvl: 29,
        fitness: 100,
        make_req: ["evil_pass"],
        join_req: [],
        getTitle: function (x_coord, y_coord) {
            return "مجموعة الذئب 2";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 10,
        heroNum: 3,
        techLvl: 10,
        heroLvl: 255,
        hitArea: [33, 111, 56, 126, 85, 113, 78, 37, 53, 34],
        tileName: {0: "wolfStatue"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },
    "155": {
        snapShoot: "wolf_3.png",
        ar_title: "مجموعة الذئب 3",
        prom_lvl: 29,
        fitness: 100,
        make_req: ["evil_pass"],
        join_req: [],
        getTitle: function (x_coord, y_coord) {
            return "مجموعة الذئب 3";
        },
        desc: `التخلي عن النضال عديمة الفائدة! أنا هنا لإنهاء حياتك السلمية.

الجمهورية الرومانية تتعرض للهجوم من قبل              Skullbearer Fearless ويشارك اللوردات في المعركة مع قوات المتمردين.
             وبالتالي لا يوجد عدد كاف من القوات للحفاظ على النظام في المدن.
            في هذا الوقت ، تتعرض الثروة الشعبية للتهديد من قبل مجرمين مثل اللصوص وعصابات العصابات المتجولين وعصابات العصابات ،
             وكلهم يختبئون في الجمهورية الرومانية لفترة طويلة. إنهم يقرعون ويقتلون السكان ، مما يجعل الناس يعانون.
            أيضا ، يحرقون المنازل لإخراج الناس من المكان الذي يعيشون فيه ، مما يسبب عدم استقرار المجتمع.
            الآن المواطنون الرومانيون يتوقون إلى الحياة السلمية وينتظرون المنقذ الذي يمكنه القضاء على الجرائم وتقديمهم إلى الحياة السعيدة السابقة.`,

        maxLvl: 10,
        heroNum: 3,
        techLvl: 10,
        heroLvl: 255,
        hitArea: [33, 111, 56, 126, 85, 113, 78, 37, 53, 34],
        tileName: {0: "wolfStatue"},
        timeNextRest: function () {
            return TimeRest.restEvery4();
        }
    },

    isPromLvlOk: function (type) {
        var camp = Elkaisar.World.UnitTypeData[type];
        return (Elkaisar.DPlayer.Player.porm >= camp.reqProm);
    },

    isAttackable: function (type) {
        var camp = Elkaisar.World.UnitTypeData[type];
        for (var mat in camp.MakeReq) {
            if (Matrial.getPlayerAmount(camp.MakeReq[mat].Item) < camp.MakeReq[mat].amount) {
                return false;
            }
        }
        return (Elkaisar.DPlayer.Player.porm >= camp.reqProm);
    }



};



Elkaisar.World.Map.base = {x: 0, y: 0};
Elkaisar.World.Map.active = false;
Elkaisar.World.Map.dragging = false;
Elkaisar.World.Map.dragStartOn = 0;
Elkaisar.World.Map.dragStartAt = {x: 0, y: 0};
Elkaisar.World.Map.lastMouse = {x: 0, y: 0};
Elkaisar.World.Map.diff = {x: 0, y: 0};


Elkaisar.World.Map.deltaDrag = {x: 0, y: 0};




Elkaisar.World.Map.mouseMoveFn = function (e) {

    if (!Elkaisar.World.Map.dragging) {
        return;
    }

    if (Elkaisar.World.Map.dragStartOn === 0) {
        Elkaisar.World.Map.dragStartOn = Date.now();
        Elkaisar.World.Map.dragStartAt.x = Crafty.viewport.x;
        Elkaisar.World.Map.dragStartAt.y = Crafty.viewport.y;
    }

    Crafty.onDragClickable = false;


    Elkaisar.World.Map.diff.x = e.clientX - Elkaisar.World.Map.lastMouse.x;
    Elkaisar.World.Map.diff.y = e.clientY - Elkaisar.World.Map.lastMouse.y;

    Elkaisar.World.Map.lastMouse.x = e.clientX;
    Elkaisar.World.Map.lastMouse.y = e.clientY;



    var viewport = Crafty.viewport;
    viewport.x += Elkaisar.World.Map.diff.x / viewport._scale;
    viewport.y += Elkaisar.World.Map.diff.y / viewport._scale;
    Elkaisar.World.Map.Scroll();

};


Elkaisar.World.Map.mouseUpFn = function (e) {

    setTimeout(function () {
        Crafty.onDragClickable = true;
    }, 100);

    Elkaisar.World.Map.RefreshWorld();
    
    Elkaisar.World.Map.clear();
    Elkaisar.World.Map.dragging = false;
    Elkaisar.World.Map.dragStartOn = 0;
};



Elkaisar.World.Map.mouseDownFn = function (e) {


    if (Elkaisar.World.Map.dragging)
        return;

    Crafty.trigger("StopCamera");
    Elkaisar.World.Map.lastMouse.x = e.clientX;
    Elkaisar.World.Map.lastMouse.y = e.clientY;

    Elkaisar.World.Map.base.x = Crafty.viewport.x;
    Elkaisar.World.Map.base.y = Crafty.viewport.y;

    Elkaisar.World.Map.dragging = true;



};





Elkaisar.World.Map.Scroll = function (Force) {

    if (Crafty._floor !== "world")
        return;

    var viewport = Crafty.viewport;



    if (Math.abs(viewport.x - Elkaisar.World.Map.base.x) >= 50 || Math.abs(viewport.y - Elkaisar.World.Map.base.y) >= 50 || Force) {


        Elkaisar.World.Map.base.x = viewport.x;
        Elkaisar.World.Map.base.y = viewport.y;

        var xCoord = -Elkaisar.World.Map.xCoord(viewport.x, viewport.y) - 2;
        var yCoord = -Elkaisar.World.Map.yCoord(viewport.x, viewport.y);
        var widthInTile = Elkaisar.World.Map.widthInTile() + 4;
        var heightInTile = Elkaisar.World.Map.heightInTile() + 4;


        var vvv = 0;
        var kkk = 0;

        for (; vvv <= heightInTile; vvv++) {
            for (; kkk <= widthInTile; kkk++) {

                addMapUnite({x: xCoord + vvv + kkk, y: yCoord + vvv - kkk});
                addMapUnite({x: xCoord + vvv + kkk + 1, y: yCoord + vvv - kkk});

            }
            kkk = 0;
        }


        var floorXStart = xCoord - (xCoord % 10) - 20;
        var floorYStart = yCoord - (yCoord % 10);
        var iii = 0;
        var jjj = 0;

        for (; iii <= heightInTile + 20; iii += 10) {
            for (; jjj <= widthInTile + 20; jjj += 10) {


                addMapWorldFloor({x: floorXStart + iii + jjj, y: floorYStart + iii - jjj});
                addMapWorldFloor({x: floorXStart + iii + jjj + 10, y: floorYStart + iii - jjj});

            }
            jjj = 0;
        }

    }


};



Elkaisar.World.Map.RefreshWorld = function () {

    Animation.cityFlag();
    Animation.cityColonizerFlag();
};


Elkaisar.World.Map.getWorldCity = function () {

    ws.send(JSON.stringify({
        url: "World/getWorldCity"
    }));


};
Elkaisar.World.Map.getWorldCityColonized = function () {

    ws.send(JSON.stringify({
        url: "World/getWorldCityColonized"
    }));


};